#students = {'Johnny', 'Bilbo', 'Steve', 'Khendrik', 'Aaron'}
#print(students)
#grades = [[5,3,3,5,4], [2,2,2,3], [4,5,5,2], [4,4,3], [5,5,5,4,5]]
#print(grades)
#-----------------------------------------------------------------
#A = sum(grades[0]) / len(grades[0])
#B = sum(grades[1]) / len(grades[1])
#J = sum(grades[2]) / len(grades[2])
#K = sum(grades[3]) / len(grades[3])
#S = sum(grades[4]) / len(grades[4])
#-----------------------------------------------------------------
#grades_mid = [A, B, J, K, S]        #СПИСОК средних оценок без просвоения к ключам
#-----------------------------------------------------------------
#st_sort = sorted(students)
#-----------------------------------------------------------------
#dict = {st_sort[0] : A, st_sort[1] : B, st_sort[2] : J, st_sort[3] : K, st_sort[4] : S}
#print(dict)



students = {input('Имя ученика: '),            # здесь можно ввести разные имена учеников,
            input('Имя ученика: '),            # в дальнейшем они будут расположены в алфавитном порядке.
            input('Имя ученика: '),
            input('Имя ученика: '),
            input('Имя ученика: ')}
print(students)
grades = [[5,3,3,5,4], [2,2,2,3], [4,5,5,2], [4,4,3], [5,5,5,4,5]]     # хотелось бы создать возможность указывания других отметок
print(grades)
#-----------------------------------------------------------------
A = sum(grades[0]) / len(grades[0])
B = sum(grades[1]) / len(grades[1])
J = sum(grades[2]) / len(grades[2])
K = sum(grades[3]) / len(grades[3])
S = sum(grades[4]) / len(grades[4])
#-----------------------------------------------------------------
grades_mid = [A, B, J, K, S]        #СПИСОК средних оценок без просвоения к ключам
#-----------------------------------------------------------------
st_sort = sorted(students)       # сортировка имен в алфавитном порядке
#-----------------------------------------------------------------
dict = {st_sort[0] : A, st_sort[1] : B, st_sort[2] : J, st_sort[3] : K, st_sort[4] : S}
print('Оценки: ', dict)




